Revit 2027 API
PointCloudEngineRegistry.IsEngineFileBased Method
 Identifies if a given engine is file-based.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsEngineFileBased(
	string identifier
)
Public Shared Function IsEngineFileBased (
	identifier As String
) As Boolean
public:
static bool IsEngineFileBased(
	String^ identifier
)
static member IsEngineFileBased :
        identifier : string -> bool
Parameters
identifier String
 The engine identifier.
Return Value
Boolean
 True if the engine is file-based, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointCloudEngineRegistry Class
Autodesk.Revit.DB.PointClouds Namespace